WELCOME = (
    "<b>Приветик 😽 С этим ботом ты можешь скачать картинки с кошкодевочками 🎁</b>\n\n"
    "<b>Используй команды 👇</b>\n"
    "/meow - генерация картинки\n"
    "/nsfw - генерация картинки (NSFW)\n\n"
    "<b>👾 Подробнее о боте:</b>\n"
    "Бот основан на репозитории <a href='https://github.com/NyarchLinux'>Nyarch Linux.</a>\n"
    "<a href='https://github.com/NyarchLinux/CatgirlDownloader'>😼 CatGirlDownloader</a>"
)

SFW_CAPTION = "🟢 SFW"
NSFW_CAPTION = "🔞 NSFW (18+)"

RATELIMIT_MESSAGE = (
    "<b>Прости друг, но ты все делаешь слишком часто 😿</b>\n"
    "Возвращайся через <b>10 секунд</b>!"
)

QUEUE_DENY = (
    "<b>Дождитесь генерации изображения 😾</b>"
)